In [2]:
%load_ext sql

In [5]:
%sql postgresql://localhost/cse2003

'Connected: @cse2003'

# Data Definition Language (DDL)

Simple SQL queries for DDL.

Create a table for storing student records.

In [8]:
%%sql
CREATE TABLE students (enrollnum NUMERIC(12) PRIMARY KEY, name VARCHAR(30), email VARCHAR(50), phone NUMERIC(10));

 * postgresql://localhost/cse2003
(psycopg2.ProgrammingError) relation "students" already exists
 [SQL: 'CREATE TABLE students (enrollnum NUMERIC(12) PRIMARY KEY, name VARCHAR(30), email VARCHAR(50), phone NUMERIC(10));'] (Background on this error at: http://sqlalche.me/e/f405)

Equivalent of DESCRIBE <table_name>; for a pre-created table.

In [7]:
%sql SELECT column_name, data_type, character_maximum_length FROM information_schema.COLUMNS WHERE TABLE_NAME = 'students';

 * postgresql://localhost/cse2003
4 rows affected.

[('enrollnum', 'numeric', None),
 ('name', 'character varying', 30),
 ('email', 'character varying', 50),
 ('phone', 'numeric', None)]

Create another table for storing courses data.

In [10]:
%sql CREATE TABLE courses (code VARCHAR(7), website VARCHAR(250), programme VARCHAR(10));

 * postgresql://localhost/cse2003
Done.

[]

Delete the entire table of courses.

In [11]:
%%sql
DROP TABLE courses;

 * postgresql://localhost/cse2003
Done.

[]

## Data Manipulation Language
Simple SQL queries for performing CRUD operations inside database tables.

| Initial | Operation | SQL Keyword |
| --- | --- | --- |
| C | Create | INSERT |
| R | Read | SELECT |
| U | Update | UPDATE |
| D | Delete | DELETE |

In [15]:
%sql INSERT INTO students (enrollnum, name, email, phone) VALUES (170020203040, 'Swarup Ghosh', 'snwg@live.com', 8961517827);

 * postgresql://localhost/cse2003
1 rows affected.

[]

In [16]:
% sql SELECT * FROM students;

 * postgresql://localhost/cse2003
1 rows affected.

[(Decimal('170020203040'), 'Swarup Ghosh', 'snwg@live.com', Decimal('8961517827'))]

In [17]:
%sql INSERT INTO students (enrollnum, name, email, phone) VALUES (1001, 'Student A', 'studentA@gdgu.org', 9009009009);

 * postgresql://localhost/cse2003
1 rows affected.

[]

In [19]:
%sql INSERT INTO students (enrollnum, name, email, phone) VALUES (1002, 'Student A', 'studentA@gdgu.org', 9009009009), (1003, 'Student B', 'studentB@gdgu.org', 9009009001);

 * postgresql://localhost/cse2003
2 rows affected.

[]

In [20]:
%sql SELECT * FROM students;

 * postgresql://localhost/cse2003
4 rows affected.

[(Decimal('170020203040'), 'Swarup Ghosh', 'snwg@live.com', Decimal('8961517827')),
 (Decimal('1001'), 'Student A', 'studentA@gdgu.org', Decimal('9009009009')),
 (Decimal('1002'), 'Student A', 'studentA@gdgu.org', Decimal('9009009009')),
 (Decimal('1003'), 'Student B', 'studentB@gdgu.org', Decimal('9009009001'))]

In [23]:
%sql UPDATE students SET enrollnum = (enrollnum - 1000 + 170020203040) WHERE enrollnum < 1050;

 * postgresql://localhost/cse2003
3 rows affected.

[]

In [25]:
%sql SELECT * FROM students;

 * postgresql://localhost/cse2003
4 rows affected.

[(Decimal('170020203040'), 'Swarup Ghosh', 'snwg@live.com', Decimal('8961517827')),
 (Decimal('170020203041'), 'Student A', 'studentA@gdgu.org', Decimal('9009009009')),
 (Decimal('170020203042'), 'Student A', 'studentA@gdgu.org', Decimal('9009009009')),
 (Decimal('170020203043'), 'Student B', 'studentB@gdgu.org', Decimal('9009009001'))]